sterentev/atdf-device-asm-include/inc/ATmega162.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	TCCR3A		= 0x8B		; [MEMORY MAPPED] Timer/Counter3 Control Register A
.equ	TCCR3B		= 0x8A		; [MEMORY MAPPED] Timer/Counter3 Control Register B
.equ	TCNT3		= 0x88		; [MEMORY MAPPED] Timer/Counter3  Bytes
.equ	OCR3A		= 0x86		; [MEMORY MAPPED] Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3B		= 0x84		; [MEMORY MAPPED] Timer/Counter3 Output Compare Register B  Bytes
.equ	ICR3		= 0x80		; [MEMORY MAPPED] Timer/Counter3 Input Capture Register  Bytes
.equ	ETIMSK		= 0x7D		; [MEMORY MAPPED] Extended Timer/Counter Interrupt Mask Register
.equ	ETIFR		= 0x7C		; [MEMORY MAPPED] Extended Timer/Counter Interrupt Flag register
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Enable Mask
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock prescale register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	UCSR1C		= 0x3C		; USART Control and Status Register C
.equ	UBRR1H		= 0x3C		; USART Baud Rate Register High Byte
.equ	GICR		= 0x3B		; General Interrupt Control Register
.equ	GIFR		= 0x3A		; General Interrupt Flag Register
.equ	TIMSK		= 0x39		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x38		; Timer/Counter Interrupt Flag register
.equ	SPMCR		= 0x37		; Store Program Memory Control Register
.equ	EMCUCR		= 0x36		; Extended MCU Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUCSR		= 0x34		; MCU Control And Status Register
.equ	TCCR0		= 0x33		; Timer/Counter 0 Control Register
.equ	TCNT0		= 0x32		; Timer/Counter 0 Register
.equ	OCR0		= 0x31		; Timer/Counter 0 Output Compare Register
.equ	SFIOR		= 0x30		; Special Function IO Register
.equ	TCCR1A		= 0x2F		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x2E		; Timer/Counter1 Control Register B
.equ	TCNT1		= 0x2C		; Timer/Counter1  Bytes
.equ	OCR1A		= 0x2A		; Timer/Counter1 Output Compare Register A  Bytes
.equ	OCR1B		= 0x28		; Timer/Counter1 Output Compare Register B  Bytes
.equ	TCCR2		= 0x27		; Timer/Counter Control Register
.equ	ASSR		= 0x26		; Asynchronous Status Register
.equ	ICR1		= 0x24		; Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT2		= 0x23		; Timer/Counter Register
.equ	OCR2		= 0x22		; Output Compare Register
.equ	WDTCR		= 0x21		; Watchdog Timer Control Register
.equ	UCSR0C		= 0x20		; USART Control and Status Register C
.equ	UBRR0H		= 0x20		; USART Baud Rate Register High Byte
.equ	EEAR		= 0x1E		; EEPROM Address Register Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTA		= 0x1B		; Port A Data Register
.equ	DDRA		= 0x1A		; Port A Data Direction Register
.equ	PINA		= 0x19		; Port A Input Pins
.equ	PORTB		= 0x18		; Port B Data Register
.equ	DDRB		= 0x17		; Port B Data Direction Register
.equ	PINB		= 0x16		; Port B Input Pins
.equ	PORTC		= 0x15		; Port C Data Register
.equ	DDRC		= 0x14		; Port C Data Direction Register
.equ	PINC		= 0x13		; Port C Input Pins
.equ	PORTD		= 0x12		; Port D Data Register
.equ	DDRD		= 0x11		; Port D Data Direction Register
.equ	PIND		= 0x10		; Port D Input Pins
.equ	SPDR		= 0x0F		; SPI Data Register
.equ	SPSR		= 0x0E		; SPI Status Register
.equ	SPCR		= 0x0D		; SPI Control Register
.equ	UDR0		= 0x0C		; USART I/O Data Register
.equ	UCSR0A		= 0x0B		; USART Control and Status Register A
.equ	UCSR0B		= 0x0A		; USART Control and Status Register B
.equ	UBRR0L		= 0x09		; USART Baud Rate Register Low Byte
.equ	ACSR		= 0x08		; Analog Comparator Control And Status Register
.equ	PORTE		= 0x07		; Data Register, Port E
.equ	DDRE		= 0x06		; Data Direction Register, Port E
.equ	PINE		= 0x05		; Input Pins, Port E
.equ	OSCCAL		= 0x04		; Oscillator Calibration Value
.equ	OCDR		= 0x04		; On-Chip Debug Related Register in I/O Memory
.equ	UDR1		= 0x03		; USART I/O Data Register
.equ	UCSR1A		= 0x02		; USART Control and Status Register A
.equ	UCSR1B		= 0x01		; USART Control and Status Register B
.equ	UBRR1L		= 0x00		; USART Baud Rate Register Low Byte


; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TIMSK bits		------------------------
.equ	TOIE1		= 7		; 0x80 - Timer/Counter1 Overflow Interrupt Enable
.equ	OCIE1A		= 6		; 0x40 - Timer/Counter1 Output CompareA Match Interrupt Enable
.equ	OCIE1B		= 5		; 0x20 - Timer/Counter1 Output CompareB Match Interrupt Enable
.equ	TICIE1		= 3		; 0x08 - Timer/Counter1 Input Capture Interrupt Enable

; ----------	Register TIFR bits		------------------------
.equ	TOV1		= 7		; 0x80 - Timer/Counter1 Overflow Flag
.equ	OCF1A		= 6		; 0x40 - Output Compare Flag 1A
.equ	OCF1B		= 5		; 0x20 - Output Compare Flag 1B
.equ	ICF1		= 3		; 0x08 - Input Capture Flag 1

; ----------	Register TCCR1A bits		------------------------
.equ	COM1A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM1A0		= 6		;          COM1A BIT0 position
.equ	COM1B_MASK	= 0x30		;      - Compare Output Mode 1B, bits (2 bits)
.equ	COM1B0		= 4		;          COM1B BIT0 position
.equ	FOC1A		= 3		; 0x08 - Force Output Compare for Channel A
.equ	FOC1B		= 2		; 0x04 - Force Output Compare for Channel B
.equ	TCCR1A_WGM1_MASK= 0x03		;      - Pulse Width Modulator Select Bits (2 bits)
.equ	TCCR1A_WGM10	= 0		;          TCCR1A_WGM1 BIT0 position

; ----------	Register TCCR1B bits		------------------------
.equ	ICNC1		= 7		; 0x80 - Input Capture 1 Noise Canceler
.equ	ICES1		= 6		; 0x40 - Input Capture 1 Edge Select
.equ	TCCR1B_WGM1_MASK= 0x18		;      - Pulse Width Modulator Select Bits (2 bits)
.equ	TCCR1B_WGM10	= 3		;          TCCR1B_WGM1 BIT0 position
.equ	CS1_MASK	= 0x07		;      - Clock Select1 bits (3 bits)
.equ	CS10		= 0		;          CS1 BIT0 position
; ::::  CS1	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register ETIMSK bits		------------------------
.equ	TICIE3		= 5		; 0x20 - Timer/Counter3 Input Capture Interrupt Enable
.equ	OCIE3A		= 4		; 0x10 - Timer/Counter3 Output CompareA Match Interrupt Enable
.equ	OCIE3B		= 3		; 0x08 - Timer/Counter3 Output CompareB Match Interrupt Enable
.equ	TOIE3		= 2		; 0x04 - Timer/Counter3 Overflow Interrupt Enable

; ----------	Register ETIFR bits		------------------------
.equ	ICF3		= 5		; 0x20 - Input Capture Flag 3
.equ	OCF3A		= 4		; 0x10 - Output Compare Flag 3A
.equ	OCF3B		= 3		; 0x08 - Output Compare Flag 3B
.equ	TOV3		= 2		; 0x04 - Timer/Counter3 Overflow Flag

; ----------	Register TCCR3A bits		------------------------
.equ	COM3A_MASK	= 0xC0		;      - Compare Output Mode 3A, bits (2 bits)
.equ	COM3A0		= 6		;          COM3A BIT0 position
.equ	COM3B_MASK	= 0x30		;      - Compare Output Mode 3B, bits (2 bits)
.equ	COM3B0		= 4		;          COM3B BIT0 position
.equ	FOC3A		= 3		; 0x08 - Force Output Compare for Channel A
.equ	FOC3B		= 2		; 0x04 - Force Output Compare for Channel B
.equ	TCCR3A_WGM3_MASK= 0x03		;      - Pulse Width Modulator Select Bits (2 bits)
.equ	TCCR3A_WGM30	= 0		;          TCCR3A_WGM3 BIT0 position

